Revit 2022 API
AnalyticalModelColumn Members
The AnalyticalModelColumn type exposes the following members.
Methods
Name | Description
Approximate
 Switches between non-approximated (e.g., Curved) Analytical Models and approximated (made up of lines only) Analytical Models
 (Inherited from AnalyticalModel.)
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanApproximate
 Indicates if Analytical Model can be approximated or not.
 (Inherited from AnalyticalModel.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanDeleteSubelement
 Checks if given subelement can be removed from the element.
 (Inherited from Element.)
CanDisableAutoDetect
 Indicates if Analytical Auto-detect can be disabled programmatically
 (Inherited from AnalyticalModel.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveRigidLinks
 Indicates if Analytical Model supports Rigid Links.
 (Inherited from AnalyticalModel.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
CanUseHardPoints
 Indicates if Analytical Model can use Hard Points.
 (Inherited from AnalyticalModel.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
CloneAdjustment
 The method clones the adjustment of one end of the AM on another AM, with respect to the one of the ends. One of the Analytical Model ends
 (Inherited from AnalyticalModel.)
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
DeleteSubelement
 Removes a subelement from the element.
 (Inherited from Element.)
DeleteSubelements
 Removes the subelements from the element.
 (Inherited from Element.)
Disconnect
 Unjoin from Hub Element.
 (Inherited from AnalyticalModel.)
Dispose |  (Inherited from Element.)
Enable
 Enables or disables Analytical Model, if the Element allows a one-operation Analytical Model toggle.
 (Inherited from AnalyticalModel.)
EnableAutoDetect
 Enable or disable Analytical Auto-detect.
 (Inherited from AnalyticalModel.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAlignmentMethod
 Gets the alignment method for a given selector.
 (Inherited from AnalyticalModelStick.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetAnalyticalModelSketchComponents
 Retrieves a collection of AnalyticalModelSketchComponent objects, which are useful for those Analytical Models that have finer calibration below the Element level.
 (Inherited from AnalyticalModel.)
GetAnalyticalModelSupports
 Retrieves the AnalyticalModelSupport array, which is useful to extract Analytical Support Information from Elements.
 (Inherited from AnalyticalModel.)
GetAnalyzeAs
 Returns value of Analyze As parameter for Analytical Model.
 (Inherited from AnalyticalModel.)
GetApproximationDeviation
 Retrieves amount by which approximation is made.
 (Inherited from AnalyticalModel.)
GetAutoDetectMatchedElements
 Retrieves other Element Ids that this Element is Auto-detecting against.
 (Inherited from AnalyticalModel.)
GetCurve
 Returns the single curve of the Analytical Model, if it is only one curve.
 (Inherited from AnalyticalModel.)
GetCurves
 Retrieves all curves for the Analytical Model of a given type.
 (Inherited from AnalyticalModel.)
GetDependentElements
 Get all elements that, from a logical point of view, are the children of this Element.
 (Inherited from Element.)
GetElementId
 Retrieves Element Id of the structural element corresponding to the Analytical Model.
 (Inherited from AnalyticalModel.)
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLocalCoordinateSystem()
 Gets the local coordinate system (LCS) for an analytical model element.
 (Inherited from AnalyticalModel.)
GetLocalCoordinateSystem(Double)
 Gets the local coordinate system (LCS) that reflects analytical model orientation at the specified parameter value along a curve.
 (Inherited from AnalyticalModelStick.)
GetLocalCoordinateSystem(XYZ)
 Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
 (Inherited from AnalyticalModelStick.)
GetManualAdjustmentMatchedElements
 Retrieves other Element Ids against which the Analytical Model has been adjusted.
 (Inherited from AnalyticalModel.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMemberForces
 Gets the member forces associated with this element.
 (Inherited from AnalyticalModelStick.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOffset
 Gets the offset of the analytical model at end.
 (Inherited from AnalyticalModel.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameter
Retrieves a parameter from the element given identifier.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetPoint
 Retrieves point of the Analytical Model.
 (Inherited from AnalyticalModel.)
GetProjectionPlaneY
 Retrieves analytical model projection information for Y direction.
 (Inherited from AnalyticalModelStick.)
GetProjectionPlaneZ
 Retrieves analytical model projection information for Z direction.
 (Inherited from AnalyticalModelStick.)
GetProjectionY
 Retrieves analytical model projection information for Y direction.
 (Inherited from AnalyticalModelStick.)
GetProjectionZ
 Retrieves analytical model projection information for Z direction.
 (Inherited from AnalyticalModelStick.)
GetReference
 Returns a reference to a given curve within the analytical model.
 (Inherited from AnalyticalModel.)
GetReleases
 Gets the releases of element.
 (Inherited from AnalyticalModelStick.)
GetReleaseType
 Gets the release type.
 (Inherited from AnalyticalModelStick.)
GetRigidLink
 Returns rigid link curve corresponding to selector.
 (Inherited from AnalyticalModel.)
GetSubelements
 Returns the collection of element subelements.
 (Inherited from Element.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasDeletedLinks
 Indicates if Analytical Model contains deleted Analytical Links.
 (Inherited from AnalyticalModel.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
HasRigidLinksWith
 Indicates if Analytical Model has Rigid Links with specified element.
 (Inherited from AnalyticalModel.)
IsAnalyzeAsValid
 Determines if the given Analyze As parameter is valid for this Element.
 (Inherited from AnalyticalModel.)
IsApproximated
 Indicates if Analytical Model is approximated or not.
 (Inherited from AnalyticalModel.)
IsAutoDetectEnabled
 Reports if Analytical Auto-detect for the given direction is enabled.
 (Inherited from AnalyticalModel.)
IsCreatedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsDemolishedPhaseOrderValid
 Returns true if createdPhaseId and demolishedPhaseId are in order.
 (Inherited from Element.)
IsElementFullySupported
 Indicates if Analytical Model is fully supported.
 (Inherited from AnalyticalModel.)
IsEnabled
 Reports whether the Analytical Model is enabled or disabled.
 (Inherited from AnalyticalModel.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsManuallyAdjusted
 Indicates if the Analytical Model has been manually adjusted by the user.
 (Inherited from AnalyticalModel.)
IsModified
 Checks if AM has been adjusted from auto-detect at any end.
 (Inherited from AnalyticalModel.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsSingleCurve
 Indicates if the Analytical Model can be expressed as a single curve.
 (Inherited from AnalyticalModel.)
IsSinglePoint
 Indicates if the Analytical Model can be expressed as a single point.
 (Inherited from AnalyticalModel.)
IsValidDirectionForAutoDetect
 Tests if the supplied direction is valid for Analytical Auto-detect.
 (Inherited from AnalyticalModel.)
IsValidForManualAdjustment
 Indicates if the identified reference is acceptable for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidManualAdjustmentSource
 Indicates if the identified reference is acceptable as a source for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidManualAdjustmentTarget
 Indicates if reference is acceptable as a "Target" for Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
IsValidRigidLinksOption
 Indicates if Rigid Links option is valid for the Analytical Model.
 (Inherited from AnalyticalModel.)
IsValidSelector
 Indicates if the input selector is valid for the Analytical Model.
 (Inherited from AnalyticalModel.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
ManuallyAdjust
 Perform Manual Analytical Adjustment on analytical model, with respect to another Element
 (Inherited from AnalyticalModel.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
RemoveAllMemberForces
 Removes all member forces associated with element.
 (Inherited from AnalyticalModelStick.)
RemoveMemberForces
 Removes member forces defined for given position.
 (Inherited from AnalyticalModelStick.)
ResetLinks
 The function is trying to recreate analytical link elements that were deleted by the user.
 (Inherited from AnalyticalModel.)
ResetManualAdjustment
 Resets all manual adjustments performed by the user onto the Analytical Model.
 (Inherited from AnalyticalModel.)
SetAlignmentMethod
 Sets the alignment method for a given selector.
 (Inherited from AnalyticalModelStick.)
SetAnalyzeAs
 Sets value of Analyze As parameter for this Element.
 (Inherited from AnalyticalModel.)
SetApproximationDeviation
 Adjusts the amount by which approximation is made.
 (Inherited from AnalyticalModel.)
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetMemberForces(MemberForces)
 Sets Member Forces to element.
 (Inherited from AnalyticalModelStick.)
SetMemberForces(Boolean, XYZ, XYZ)
 Adds Member Forces to element.
 (Inherited from AnalyticalModelStick.)
SetOffset
 Sets the offset of the analytical model at end.
 (Inherited from AnalyticalModel.)
SetProjection(AnalyticalElementSelector, ElementId, ElementId)
 Sets the analytical model projection to a preset value.
 (Inherited from AnalyticalModelStick.)
SetProjection(AnalyticalElementSelector, ElementId, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
 (Inherited from AnalyticalModelStick.)
SetProjection(AnalyticalElementSelector, StickElementProjectionY, ElementId)
 Sets the analytical model projection to a preset value.
 (Inherited from AnalyticalModelStick.)
SetProjection(AnalyticalElementSelector, StickElementProjectionY, StickElementProjectionZ)
 Sets the analytical model projection to a preset value.
 (Inherited from AnalyticalModelStick.)
SetReleases
 Sets the releases of element.
 (Inherited from AnalyticalModelStick.)
SetReleaseType
 Sets the release type.
 (Inherited from AnalyticalModelStick.)
SetUsesHardPoints
 Sets Hard Points for the Analytical Model.
 (Inherited from AnalyticalModel.)
SupportsManualAdjustment
 Indicates if the Element supports Manual Analytical Adjustment.
 (Inherited from AnalyticalModel.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UsesHardPoints
 Indicates if the Analytical Model is using Hard Points during approximation.
 (Inherited from AnalyticalModel.)
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BaseExtension
 The base extension option.
BaseExtensionMethod
 The bottom extension method option.
BaseExtensionPlaneId
 The bottom extension plane ID option.
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsTransient
 Indicates whether an element is transient or permanent.
 (Inherited from Element.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
RigidLinksOption
 Indicates if parameters indicate if Rigid Links should be formed.
 (Inherited from AnalyticalModel.)
TopExtension
 The top extension option.
TopExtensionMethod
 The top extension method option.
TopExtensionPlaneId
 The top extension plane ID option.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
VersionGuid
 Get the element version Guid.
 (Inherited from Element.)
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
AnalyticalModelColumn Class
Autodesk.Revit.DB.Structure Namespace